## Pandas Basis

In [1]:
# import necessary package
import pandas as pd
import numpy as np

In [2]:
# generate a dataset and convert to pandas dataframe

data = {'name': ['Jack', 'Annie', 'Bob', 'Jake', 'Jasper'],
        'year': [2012, 2012, 2013, 2014, 2014],
        'grades': [4, 20, 15, 7, 24],
        'coverage': [25, 94, 57, 62, 70]}

df = pd.DataFrame(data, index = ['Cochic', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

            coverage  grades    name  year
Cochic            25       4    Jack  2012
Pima              94      20   Annie  2012
Santa Cruz        57      15     Bob  2013
Maricopa          62       7    Jake  2014
Yuma              70      24  Jasper  2014

#### 1. Show the first three rows and last two rows.

In [7]:
df.head(3)

            coverage  grades   name  year
Cochic            25       4   Jack  2012
Pima              94      20  Annie  2012
Santa Cruz        57      15    Bob  2013

In [8]:
df.tail(2)

          coverage  grades    name  year
Maricopa        62       7    Jake  2014
Yuma            70      24  Jasper  2014

#### 2. Generate a new dataframe including county,year and reports from above datafram (county and reports can be NaN)

#### 3. Add a new column attribute called "New", which is NaN.

In [12]:
df = df.assign(New=np.nan)

#### 4. Delete the column "New".

In [14]:
df = df.drop('New', axis = 1)

#### 5. Show the index and columns name.

In [15]:
df.columns

Index(['coverage', 'grades', 'name', 'year'], dtype='object')

In [16]:
df.index.values

array(['Cochic', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'], dtype=object)

#### 6. Use df.iloc to select the first row

In [9]:
df.iloc[1]

coverage       94
grades         20
name        Annie
year         2012
Name: Pima, dtype: object

#### 7. Slice the column of "coverage" and "grades".

In [17]:
df['coverage']

Cochic        25
Pima          94
Santa Cruz    57
Maricopa      62
Yuma          70
Name: coverage, dtype: int64

#### 8. select subtable of column name and year, row of Pima and Yuma

In [22]:
df.loc[['Pima','Yuma'],'year']

Pima    2012
Yuma    2014
Name: year, dtype: int64

#### 9. Use df.iloc to select the first two columns

In [20]:
df.iloc[:,0:2]

            coverage  grades
Cochic            25       4
Pima              94      20
Santa Cruz        57      15
Maricopa          62       7
Yuma              70      24

#### 10. Select by condition where grades greater than 10

In [23]:
df.loc[lambda x: x['grades']>10]

            coverage  grades    name  year
Pima              94      20   Annie  2012
Santa Cruz        57      15     Bob  2013
Yuma              70      24  Jasper  2014

#### 11. Drop Rows of Cochic and Pima

In [24]:
df.drop(['Cochic','Pima'],axis = 0)

            coverage  grades    name  year
Santa Cruz        57      15     Bob  2013
Maricopa          62       7    Jake  2014
Yuma              70      24  Jasper  2014

#### 12. Use df.drop to drop the column grades.

In [26]:
df.drop('grades' , axis = 1)

            coverage    name  year
Cochic            25    Jack  2012
Pima              94   Annie  2012
Santa Cruz        57     Bob  2013
Maricopa          62    Jake  2014
Yuma              70  Jasper  2014

#### 13. Use decribe function to show some statistics of column "coverage".

In [27]:
df.coverage.describe()

count     5.000000
mean     61.600000
std      24.905823
min      25.000000
25%      57.000000
50%      62.000000
75%      70.000000
max      94.000000
Name: coverage, dtype: float64

### Pandas Fast Visualization

Read the following reading materials:<br/>
https://pandas.pydata.org/pandas-docs/stable/visualization.html